In [1]:
import pandas as pd

#create DataFrame from RewardsData CSV
rewards_df_sample = pd.read_csv('WrangledRewardsData.csv')
rewards_df_sample

,User ID,Birthdate,City,State Name,State Abbreviation,Zip,Available Points,Total Points Earned,Points Spent,Joined On,Last Seen
0,1,1/31/1992,Minneapolis,Georgia,GA,55401,300,300,0,9/4/2020 0:15,12/16/2021 17:42
1,3,1/11/1990,Merida,Alabama,AL,97204,330,330,0,10/13/2020 16:20,4/21/2021 10:54
2,4,4/16/1990,Winston-Salem,North Carolina,NC,27106,10790,14290,3500,8/18/2020 13:21,6/30/2022 22:22
3,5,3/24/1994,Winston-Salem,North Carolina,NC,27109,650,650,0,8/21/2020 11:27,12/30/2020 10:57
4,10,7/20/1999,Winston-Salem,North Carolina,NC,27106,8465,8515,50,8/22/2020 14:42,4/9/2022 14:10
...,...,...,...,...,...,...,...,...,...,...,...
148,7220,8/7/1999,Winston-Salem,North Carolina,NC,27106,430,430,0,6/22/2022 17:36,6/26/2022 16:39
149,7219,6/12/2004,Lutherville,Maryland,MD,21093,490,490,0,6/22/2022 17:28,6/30/2022 8:43
150,7220,8/7/1999,Winston-Salem,North Carolina,NC,27106,430,430,0,6/22/2022 17:36,6/26/2022 16:39
151,7227,3/14/2000,Clemmons,North Carolina,NC,27012,460,460,0,6/23/2022 22:18,6/29/2022 23:40
152,7230,5/18/1999,Winston-Salem,North Carolina,NC,27107,410,410,0,6/24/2022 16:03,6/24/2022 16:06

In [2]:
# check for duplicates
duplicates = rewards_df_sample.duplicated()
duplicates

0      False
1      False
2      False
3      False
4      False
       ...
148    False
149     True
150     True
151    False
152    False
Length: 153, dtype: bool

In [3]:
# get the count of duplicate records
duplicates.sum()

np.int64(9)

In [4]:
# remove duplicates
rewards_df_clean = rewards_df_sample.drop_duplicates()

# confirm duplicates haev been removed
duplicates = rewards_df_clean.duplicated()
duplicates.sum()

np.int64(0)

In [5]:
# export dataframe to CSV file
rewards_df_clean.to_csv("CleanRewardsData.csv")

In [7]:
# remove duplicates based on specific columns
# create sample dataframe with duplicate values within columns
data = {'A':[1,2,2,3,3,3], 'B':[1,1,2,2,3,3]}
df = pd.DataFrame(data)
df

   A  B
0  1  1
1  2  1
2  2  2
3  3  2
4  3  3
5  3  3

In [8]:
# remove duplicates based on subset of columns
df_unique_subset = df.drop_duplicates(subset=['A'], keep='first') # keep first occurence
df_unique_subset

   A  B
0  1  1
1  2  1
3  3  2